[
   {
     "name": "Whiskers",
     "age": 4,
     "location": "Gulshan",
     "details": "Whiskers, the sophisticated Siamese cat, is seeking a home where he can bask in sunny spots and enjoy quiet moments. He's a loyal companion with a love for cozy laps and gentle strokes.",
     "image": "https://i.ibb.co/B6b5Z1y/c1.jpg",
     "category": "cat"
   },
   {
     "name": "English Springer Spaniel",
     "age": 3,
     "location": "Dhanmondi",
     "details": "Meet Luna, a friendly Golden Retriever with a heart of gold. Luna enjoys belly rubs, cozy evenings by the fireplace, and is known for her gentle nature. She's seeking a loving home with lots of cuddles.",
     "image": "https://i.ibb.co/Rvtd7S9/d2.jpg",
     "category": "dog"
   },
   {
     "name": "Buddy",
     "age": 1,
     "location": "Banani",
     "details": "Buddy, the playful Beagle, is looking for a home filled with laughter and joy. He's a social pup who loves meeting new friends, and his charming personality is sure to bring happiness to any family.",
     "image": "https://i.ibb.co/3cCyZNd/d3.jpg",
     "category": "dog"
   },
   {
     "name": "Max",
     "age": 2,
     "location": "Khilkhet",
     "details": "Max is an energetic and playful Labrador Retriever. He loves long walks in the park, playing fetch, and is great with kids. Max is looking for an active family who can keep up with his enthusiasm for life.",
     "image": "https://i.ibb.co/yY9B6JB/d1.jpg",
     "category": "dog"
   },
   {
     "name": "Mittens",
     "age": 2,
     "location": "Uttara",
     "details": "Mittens, the playful and mischievous Tabby cat, is looking for a family who appreciates his antics. He enjoys interactive toys, climbing, and is ready to bring endless entertainment to your home.",
     "image": "https://i.ibb.co/b6sqRkr/c2.jpg",
     "category": "cat"
   },
   {
     "name": "Oreo",
     "age": 1,
     "location": "Barishal",
     "details": "Oreo, the curious Holland Lop rabbit, is ready to hop into your heart. With his distinctive black and white fur, Oreo is not only adorable but also loves exploring new spaces and munching on fresh greens.",
     "image": "https://i.ibb.co/C6nSB5d/r1.jpg",
     "category": "rabbit"
   },
   {
     "name": "Thumper",
     "age": 2,
     "location": "Khulna",
     "details": "Thumper, the gentle Flemish Giant rabbit, is seeking a quiet home with plenty of room to stretch his long legs. He's a calm and affectionate bunny who enjoys gentle pets and the occasional hop around the garden.",
     "image": "https://i.ibb.co/b3QSqxw/r2.jpg",
     "category": "rabbit"
   },
   {
     "name": "Cotton",
     "age": 1,
     "location": "Kuakata",
     "details": "Cotton, the fluffy Angora rabbit, is looking for a home where his luxurious fur can be appreciated. He enjoys being groomed and is a delightful addition to any family seeking a charming and affectionate bunny.",
     "image": "https://i.ibb.co/NxpcFjy/r3.jpg",
     "category": "rabbit"
   },
   {
     "name": "Bambi",
     "age": 3,
     "location": "Cox's Bazar",
     "details": "Bambi, the lively Jack Russell Terrier, is ready for adventures and playtime. With boundless energy and a love for exploring, Bambi is seeking an active family to share joyous moments and create lasting memories.",
     "image": "https://i.ibb.co/NYWqFNv/d4.jpg",
     "category": "dog"
   },
   {
     "name": "Simba",
     "age": 4,
     "location": "Ranga mati",
     "details": "Simba, the majestic Maine Coon cat, is a regal feline looking for a home where he can be treated like royalty. With his luxurious mane and affectionate nature, Simba is sure to be the king of your heart.",
     "image": "https://i.ibb.co/7nbPNjJ/c4.jpg",
     "category": "cat"
   }
 ]